; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 103819 2 2 4 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph0 - mode
	infrared1 - mode
	infrared2 - mode
	image3 - mode
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star1 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image3)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 image3)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
4. (turn_to satellite1 groundstation3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 6
5. (calibrate satellite1 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
7. (turn_to satellite1 star6 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star6)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 1 of 6
10. (turn_to satellite0 star4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star4)
   goals met: 2 of 6
11. (turn_to satellite1 phenomenon9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 6
12. (turn_to satellite0 planet10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet10)
   goals met: 1 of 6
13. (take_image satellite1 phenomenon9 instrument1 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 2 of 6
14. (take_image satellite0 planet10 instrument0 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 3 of 6
15. (turn_to satellite1 phenomenon7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 6
16. (turn_to satellite0 star4 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star4)
   goals met: 4 of 6
17. (take_image satellite1 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 5 of 6
18. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 5 of 6
19. (take_image satellite1 planet8 instrument1 image3)
   added: (have_image planet8 image3)
   goals met: 6 of 6
